require "faker/buront/version"

module Faker
  module Buront
    def self.saying
      [
        'やはり忍者よりナイトの方が頼りにされていた',
        'キングベヒーもスとの戦いでおれは集合時間に遅れてしまったんだがちょうどわきはじめたみたいでなんとか耐えているみたいだった',
        'おれはジュノにいたので急いだ',
        'ところがアワレにも忍者がくずれそうになっているっぽいのがＬＳ会話で叫んでいた',
        'どうやら忍者がたよりないらしく「はやくきて～はやくきて～」と泣き叫んでいるＬＳメンバーのために俺はとんずらを使って普通ならまだ付かない時間できょうきょ参戦すると',
        '「もうついたのか！」「はやい！」「きた！盾きた！」「メイン盾きた！」「これで勝つる！」と大歓迎状態だった',
        '忍者はアワレにも盾の役目を果たせず死んでいた',
        '近くですばやくフラッシュを使い盾をした',
        '忍者から裏テルで「勝ったと思うなよ・・・」ときたがＬＳメンバーがどっちの見方だかは一瞬でわからないみたいだった',
        '「もう勝負ついてるから」というと黙ったので戦士サポ忍の後ろに回り不意だまスフィストを打つと何回かしてたらキングベヒんもスは倒された',
        '「ナイトのおかげだ」「助かった、終わったと思ったよ」と忍者を行き帰らせるのも忘れてメンバーがおれのまわりに集まってきた忘れられてる忍者がかわいそうだった',
        '普通なら裏テルのことで無視する人がぜいいんだろうがおれは無視できなかった',
        'みんなとよｒこびほめられたかったのでレイズを唱えてやったらそうとう自分の裏テルが恥ずかしかったのかＨＰに帰って行った',
      ].sample
    end
  end
end
